{
  "name": "John Doe",
  "title": "Software Engineer",
  "summary": [
    "Proven software engineer with expertise in building and maintaining modern web applications using Angular and Python-based backend.",
    "Skilled in designing RESTful APIs with Swagger/OpenAPI and containerizing applications with Docker.",
    "Experienced in developing cloud-based applications on AWS, Azure, and GCP, and implementing CI/CD pipelines with Git.",
    "Strong understanding of performance monitoring, logging, and observability tools, and proficient in testing frameworks like PyTest and Jasmine.",
    "Collaborative team player with excellent communication skills and passion for Agile/Scrum practices.",
    "Possess strong problem-solving skills and ability to work with minimal supervision.",
    "Familiar with Eclipse and other popular development tools.",
    "Proficient in TypeScript, JavaScript, and HTML/CSS for front-end development.",
    "Strong foundation in Python programming language for backend development.",
    "Experience with Flask and SQLAlchemy for building scalable and efficient backend systems.",
    "Knowledge of Swagger/OpenAPI for API design and documentation.",
    "Strong understanding of Git for version control and collaboration.",
    "Experience with CI/CD pipelines for automating testing, building, and deployment.",
    "Familiar with containerization using Docker and cloud platforms like AWS, Azure, and GCP.",
    "Proficient in testing frameworks like PyTest and Jasmine for ensuring application quality.",
    "Strong understanding of performance monitoring, logging, and observability tools.",
    "Collaborative and adaptable team player with excellent communication skills.",
    "Passionate about learning new technologies and staying up-to-date with industry trends.",
    "Strong problem-solving skills and ability to work independently with minimal supervision."
  ],
  "experience": [
    {
      "title": "Software Engineer",
      "company": "ABC Corporation",
      "dates": "2018-2022",
      "description": [
        "Designed and developed multiple RESTful APIs using Swagger/OpenAPI and implemented with Flask and SQLAlchemy.",
        "Containerized applications using Docker and implemented CI/CD pipelines with Git for automating testing, building, and deployment.",
        "Developed cloud-based applications on AWS, Azure, and GCP, and implemented performance monitoring, logging, and observability tools.",
        "Collaborated with cross-functional teams to design and develop modern web applications using Angular and Python-based backend.",
        "Implemented testing frameworks like PyTest and Jasmine to ensure application quality and reliability.",
        "Worked with minimal supervision and demonstrated strong problem-solving skills and adaptability to changing project requirements.",
        "Participated in Agile/Scrum practices and contributed to team goals and objectives."
      ]
    }
  ],
  "education": [
    {
      "institution": "XYZ University",
      "degree": "Bachelor of Science in Computer Science",
      "dates": "2015-2018"
    }
  ],
  "tools": [
    "Angular",
    "TypeScript",
    "JavaScript",
    "HTML",
    "CSS",
    "Python",
    "Flask",
    "SQLAlchemy",
    "Swagger/OpenAPI",
    "Git",
    "Docker",
    "Kubernetes",
    "AWS",
    "Azure",
    "GCP",
    "PyTest",
    "Jasmine",
    "Karma",
    "Eclipse"
  ]
}