{
  "name": "Yallaiah Onteru",
  "title": "AI Applications Engineer Full Stack - Agentic AI & Generative AI Specialist",
  "contact": {
    "email": "yonteru.dev.ai@gmail.com",
    "phone": "9733271133",
    "portfolio": "https://yallaiah-ai-portfolio.com",
    "linkedin": "https://www.linkedin.com/in/yalleshaiengineer/",
    "github": "https://github.com/yallaiah-ai"
  },
  "professional_summary": [
    "I am having 10 years of experience in Full Stack AI development, specializing in Angular frontends, Python microservices, and AWS EKS deployments for enterprise-grade Generative AI and Agentic Workflow solutions.",
    "Architected production-ready AI Agent systems using Angular for interactive UIs, Python for orchestration layers, and AWS EKS for scalable Kubernetes deployments across Insurance and Healthcare domains.",
    "Led cross-functional teams with Gen AI scientists and UX designers to deliver Agentic AI applications, implementing autonomous workflows using CrewAI, LangGraph, and Model Context Protocol frameworks.",
    "Developed enterprise Angular applications integrated with Python-based AI Agents, deploying containerized microservices on AWS EKS while ensuring HIPAA compliance for Healthcare AI solutions.",
    "Implemented full-stack Generative AI platforms combining Angular dashboards, Python FastAPI backends, and Kubernetes orchestration for multi-agent systems serving millions of Insurance customers.",
    "Collaborated with product managers to design Agentic Workflows using Python orchestration, Angular visualization, and AWS EKS auto-scaling for real-time AI Agent communication protocols.",
    "Built production AI Agent architectures with Angular component libraries, Python microservice patterns, and AWS EKS deployment pipelines supporting autonomous decision-making in Banking systems.",
    "Engineered Gen AI applications integrating Angular reactive forms, Python LangChain frameworks, and Kubernetes pod orchestration for enterprise-scale Agentic AI proof-of-concepts.",
    "Delivered full-stack solutions combining Angular Material UI, Python asyncio patterns, and AWS EKS service mesh for distributed AI Agent coordination in Healthcare diagnostic systems.",
    "Designed microservices architecture using Angular micro-frontends, Python FastAPI services, and Kubernetes operators for deploying scalable Generative AI workflows in Consulting projects.",
    "Implemented Angular state management with NgRx for AI Agent interfaces, Python event-driven architectures, and AWS EKS horizontal pod autoscaling for enterprise AI applications.",
    "Created production-ready Agentic AI systems using Angular PWA features, Python async frameworks, and Kubernetes ConfigMaps for managing multi-agent configurations in Insurance claim processing.",
    "Developed enterprise Gen AI platforms with Angular lazy loading, Python multiprocessing capabilities, and AWS EKS ingress controllers for routing AI Agent traffic in Banking fraud detection.",
    "Built Angular component ecosystems for AI visualization, Python orchestration layers for agent communication, and Kubernetes StatefulSets for maintaining Agentic Workflow state persistence.",
    "Engineered full-stack AI solutions using Angular CDK, Python dependency injection patterns, and AWS EKS network policies ensuring secure AI Agent interactions in Healthcare environments.",
    "Collaborated with data engineers on Angular data grids, Python ETL pipelines, and Kubernetes CronJobs for scheduled AI Agent training and deployment in enterprise production systems.",
    "Implemented Angular WebSocket connections for real-time AI updates, Python message queuing systems, and AWS EKS pod disruption budgets ensuring high availability of Agentic AI services.",
    "Delivered comprehensive Gen AI applications using Angular testing frameworks, Python pytest suites, and Kubernetes health checks for monitoring AI Agent performance in production environments."
  ],
  "technical_skills": {
    "Frontend Technologies": [
      "Angular 15+",
      "Angular Material",
      "Angular CDK",
      "TypeScript",
      "RxJS",
      "NgRx",
      "React.js",
      "Vue.js",
      "JavaScript ES6+",
      "HTML5/CSS3",
      "Sass/SCSS",
      "Bootstrap"
    ],
    "Backend & Python Frameworks": [
      "Python 3.9+",
      "FastAPI",
      "Flask",
      "Django",
      "AsyncIO",
      "Celery",
      "Python Microservices",
      "REST APIs",
      "GraphQL",
      "WebSockets",
      "gRPC",
      "Message Queues"
    ],
    "AI Agents & Agentic Workflows": [
      "CrewAI",
      "LangGraph",
      "Model Context Protocol",
      "Multi-Agent Systems",
      "Agent-to-Agent Communication",
      "Agentic AI Frameworks",
      "Autonomous Workflows",
      "Agent Orchestration",
      "POC Development",
      "Agent Coordination"
    ],
    "Generative AI & LLMs": [
      "OpenAI GPT",
      "Claude AI",
      "LangChain",
      "LlamaIndex",
      "Hugging Face",
      "Vector Databases",
      "RAG Pipelines",
      "Prompt Engineering",
      "Fine-tuning",
      "Embeddings",
      "Semantic Search",
      "Token Optimization"
    ],
    "Cloud & Kubernetes (AWS EKS)": [
      "AWS EKS",
      "Kubernetes",
      "Docker",
      "Helm Charts",
      "Service Mesh",
      "Ingress Controllers",
      "ConfigMaps",
      "Secrets",
      "StatefulSets",
      "DaemonSets",
      "AWS Lambda",
      "AWS S3"
    ],
    "Microservices Architecture": [
      "Microservice Design",
      "Service Discovery",
      "API Gateway",
      "Circuit Breakers",
      "Load Balancing",
      "Service Registry",
      "Event-Driven Architecture",
      "CQRS",
      "Saga Patterns",
      "Domain-Driven Design"
    ],
    "Full Stack Engineering": [
      "Frontend-Backend Integration",
      "Full Stack Development",
      "End-to-End Testing",
      "Performance Optimization",
      "Security Best Practices",
      "CORS Configuration",
      "Authentication/Authorization",
      "Session Management"
    ],
    "DevOps & CI/CD": [
      "Jenkins",
      "GitLab CI",
      "GitHub Actions",
      "ArgoCD",
      "Terraform",
      "Ansible",
      "Docker Compose",
      "Container Registries",
      "Blue-Green Deployments",
      "Canary Releases",
      "Infrastructure as Code"
    ],
    "Collaboration Tools": [
      "Cross-functional Teams",
      "Gen AI Scientists",
      "UX Designers",
      "Product Managers",
      "Data Engineers",
      "Agile/Scrum",
      "JIRA",
      "Confluence",
      "Slack Integration",
      "Technical Documentation"
    ],
    "Enterprise Solutions": [
      "Enterprise-grade Applications",
      "Production Deployment",
      "Scalability Solutions",
      "High Availability",
      "Disaster Recovery",
      "Performance Monitoring",
      "Log Aggregation",
      "Metrics Collection",
      "SLA Management"
    ],
    "Testing & Quality": [
      "Jest",
      "Karma",
      "Jasmine",
      "Pytest",
      "Unit Testing",
      "Integration Testing",
      "E2E Testing",
      "Cypress",
      "Selenium",
      "Load Testing",
      "Performance Testing",
      "Security Testing"
    ],
    "Data & Analytics": [
      "PostgreSQL",
      "MongoDB",
      "Redis",
      "Elasticsearch",
      "Apache Kafka",
      "RabbitMQ",
      "Data Pipelines",
      "ETL Processes",
      "Real-time Processing",
      "Stream Processing",
      "Data Warehousing"
    ]
  },
  "experience": [
    {
      "role": "Senior AI Lead Developer",
      "client": "State Farm",
      "duration": "2025-Jan - Present",
      "location": "Austin, Texas",
      "responsibilities": [
        "Architected enterprise Agentic AI platform using Angular 17 micro-frontends and Python FastAPI microservices, deploying on AWS EKS with Helm charts for Insurance claim automation workflows.",
        "Led implementation of CrewAI multi-agent systems with Angular dashboards for monitoring, Python orchestration for agent coordination, and Kubernetes StatefulSets for maintaining agent state persistence.",
        "Developed Generative AI applications integrating Angular Material components with Python LangGraph backends, containerizing with Docker and deploying via AWS EKS ingress controllers for customer service.",
        "Collaborated with Gen AI scientists to build Model Context Protocol interfaces using Angular reactive forms, Python async handlers, and Kubernetes ConfigMaps for managing AI agent configurations.",
        "Engineered full-stack proof-of-concepts combining Angular PWA features with Python multi-agent frameworks, scaling horizontally on AWS EKS to handle millions of Insurance policy inquiries daily.",
        "Implemented agent-to-agent communication protocols using Angular WebSocket clients, Python message brokers, and Kubernetes service mesh for secure inter-agent data exchange in claim processing.",
        "Designed UX designer collaboration workflows with Angular component libraries, Python API gateways, and AWS EKS pod autoscaling for dynamic resource allocation during peak Insurance renewal periods.",
        "Built production AI Agent monitoring using Angular charts, Python telemetry collectors, and Kubernetes prometheus operators - initially struggled with metrics but achieved real-time observability.",
        "Created Agentic Workflow orchestration combining Angular state management, Python event sourcing, and AWS EKS CronJobs for scheduled agent training on Insurance fraud detection models daily.",
        "Delivered enterprise-grade Gen AI solutions with Angular lazy loading modules, Python circuit breakers, and Kubernetes network policies ensuring GDPR compliance for European Insurance customers.",
        "Collaborated with product managers on Angular A/B testing frameworks, Python feature flags, and AWS EKS blue-green deployments enabling gradual rollout of new AI Agent capabilities safely.",
        "Engineered microservices using Angular module federation, Python dependency injection, and Kubernetes operators for managing lifecycle of autonomous Insurance risk assessment agents effectively.",
        "Implemented full-stack testing with Angular Karma/Jasmine, Python pytest fixtures, and Kubernetes pod disruption budgets ensuring 99.9% uptime for critical Insurance AI services consistently.",
        "Developed data engineer integrations using Angular ag-Grid, Python pandas processing, and AWS EKS persistent volumes for storing agent learning data from millions of Insurance transactions.",
        "Built Angular CDK overlays for AI explanations, Python interpretability modules, and Kubernetes resource quotas managing compute allocation for complex Insurance underwriting agent decisions.",
        "Orchestrated cross-functional debugging sessions fixing Angular memory leaks, Python async deadlocks, and Kubernetes pod evictions - learned valuable lessons about distributed AI system resilience."
      ],
      "environment": [
        "Angular 17, Python, AWS EKS, Kubernetes, Docker, CrewAI, LangGraph, Model Context Protocol, FastAPI, TypeScript, Helm, Terraform, Jenkins, PostgreSQL, Redis, Kafka"
      ]
    },
    {
      "role": "Senior AI Developer",
      "client": "Johnson & Johnson",
      "duration": "2021-Aug - 2024-Dec",
      "location": "New Brunswick, New Jersey",
      "responsibilities": [
        "Developed Healthcare Agentic AI platform using Angular 15 components and Python Django REST framework, deploying containerized microservices on Azure Kubernetes Service for HIPAA-compliant operations.",
        "Implemented CrewAI agent workflows with Angular dashboard visualizations, Python orchestration layers, and proof-of-concept multi-agent systems for automated Healthcare diagnostic recommendations.",
        "Built Gen AI applications combining Angular reactive forms with Python LangChain integrations, ensuring HIPAA compliance through encrypted agent communications in Healthcare data processing pipelines.",
        "Collaborated with UX designers creating Angular Material themes, Python FastAPI endpoints, and containerized deployments for intuitive Healthcare provider interfaces managing AI diagnostic agents.",
        "Engineered full-stack solutions using Angular routing guards, Python authentication middleware, and Azure AD integration for secure Healthcare professional access to Generative AI tools.",
        "Designed LangGraph agent architectures with Angular state machines, Python workflow engines, and distributed processing for analyzing millions of Healthcare records while maintaining patient privacy.",
        "Created multi-agent coordination systems using Angular SignalR connections, Python asyncio patterns, and message queuing for real-time Healthcare emergency response AI agent collaboration.",
        "Worked closely with Gen AI scientists implementing Angular visualization libraries, Python ML pipelines, and automated testing frameworks for validating Healthcare AI model predictions accurately.",
        "Developed microservice ecosystems with Angular micro-frontends, Python service discovery, and API gateways managing communication between Healthcare AI agents and legacy hospital systems seamlessly.",
        "Built proof-of-concepts for drug interaction AI using Angular dynamic forms, Python knowledge graphs, and Neo4j databases - had to learn graph traversal algorithms for agent reasoning.",
        "Implemented data engineer workflows using Angular file uploaders, Python ETL processes, and Apache Airflow for scheduling Healthcare data ingestion into AI training pipelines nightly.",
        "Collaborated with product managers on Angular feature toggles, Python A/B testing frameworks, and gradual rollouts of new Healthcare AI capabilities to minimize disruption for medical staff.",
        "Engineered HIPAA-compliant logging with Angular interceptors, Python audit trails, and centralized log aggregation ensuring complete traceability of all Healthcare AI agent decisions made.",
        "Delivered enterprise Healthcare AI platform using Angular performance optimization, Python caching strategies, and Redis clusters reducing diagnostic AI response times from 5 seconds to 500ms."
      ],
      "environment": [
        "Angular 15, Python, Django, Azure Kubernetes, CrewAI, LangGraph, FastAPI, TypeScript, Docker, HIPAA Compliance, PostgreSQL, Redis, RabbitMQ, Elasticsearch"
      ]
    },
    {
      "role": "Senior ML Engineer",
      "client": "State of Maine",
      "duration": "2020-Apr - 2021-Jul",
      "location": "Augusta, Maine",
      "responsibilities": [
        "Architected Healthcare AI platform using Angular 12 frontends and Python Flask microservices, deploying on AWS ECS for state-wide Healthcare benefits eligibility determination systems.",
        "Developed Generative AI chatbots with Angular chat interfaces, Python NLP pipelines, and AWS Lambda functions helping citizens navigate complex Healthcare enrollment procedures effectively.",
        "Implemented full-stack applications combining Angular forms with Python validation logic, integrating with state Healthcare databases for real-time eligibility verification across departments.",
        "Collaborated with UX designers on Angular accessibility features, Python API responses, and WCAG compliance ensuring Healthcare AI tools were usable by all Maine residents equally.",
        "Built AI-powered document processing using Angular file handlers, Python OCR services, and AWS Textract for extracting Healthcare information from scanned paper applications automatically.",
        "Engineered microservices with Angular HTTP interceptors, Python middleware layers, and AWS API Gateway for secure communication between Healthcare AI services and government systems.",
        "Created Python data pipelines with Angular progress indicators, batch processing jobs, and AWS Step Functions orchestrating Healthcare data workflows for nightly benefits calculations.",
        "Worked with data engineers implementing Angular data tables, Python pandas transformations, and AWS Glue ETL jobs for preparing Healthcare datasets for AI model training.",
        "Developed HIPAA-compliant systems using Angular route guards, Python encryption libraries, and AWS KMS for protecting sensitive Healthcare information throughout the AI processing pipeline.",
        "Delivered Angular Progressive Web Apps with Python backend services, implementing offline capabilities for rural Healthcare workers with limited internet connectivity - challenging but rewarding.",
        "Implemented comprehensive testing using Angular testing utilities, Python unittest framework, and AWS Device Farm ensuring Healthcare AI applications worked across all citizen devices.",
        "Collaborated with product managers translating Healthcare regulations into Angular business logic, Python rule engines, and decision trees for accurate benefits determination by AI agents."
      ],
      "environment": [
        "Angular 12, Python, Flask, AWS ECS, AWS Lambda, AWS Textract, TypeScript, Docker, PostgreSQL, Redis, HIPAA Compliance, Terraform, Jenkins"
      ]
    },
    {
      "role": "Data Scientist",
      "client": "Bank of America",
      "duration": "2018-Jan - 2020-Mar",
      "location": "New York, New York",
      "responsibilities": [
        "Built Banking fraud detection systems using Angular 8 dashboards and Python scikit-learn models, deploying on AWS EC2 instances for real-time transaction monitoring and alerting.",
        "Developed full-stack analytics platform with Angular visualization components, Python statistical analysis, and AWS RDS for storing millions of Banking transactions for pattern recognition.",
        "Implemented AI-driven risk assessment using Angular reporting interfaces, Python TensorFlow models, and batch processing for evaluating loan applications against Banking regulations daily.",
        "Collaborated with data engineers on Angular data grids, Python ETL pipelines, and AWS S3 data lakes for consolidating Banking data from multiple sources for AI training.",
        "Created microservices architecture using Angular services, Python REST APIs, and AWS Lambda functions for serverless Banking AI inference reducing infrastructure costs significantly.",
        "Engineered PCI-compliant systems with Angular security headers, Python encryption modules, and AWS VPC configurations ensuring Banking customer data protection throughout AI workflows.",
        "Built real-time dashboards using Angular charts, Python WebSocket servers, and AWS ElastiCache for displaying Banking AI predictions to risk analysts with sub-second latency.",
        "Developed Python feature engineering pipelines with Angular configuration UIs, processing Banking transaction features for improving fraud detection model accuracy from baseline performance.",
        "Implemented A/B testing frameworks using Angular feature flags, Python experiment tracking, and statistical analysis for validating Banking AI model improvements before production deployment.",
        "Delivered comprehensive Banking AI solution using Angular responsive design, Python API optimization, and AWS CloudFront CDN for global availability to Banking compliance teams worldwide."
      ],
      "environment": [
        "Angular 8, Python, TensorFlow, Scikit-learn, AWS EC2, AWS Lambda, AWS RDS, TypeScript, Docker, PostgreSQL, Redis, PCI Compliance"
      ]
    },
    {
      "role": "Data Engineer",
      "client": "Hexaware",
      "duration": "2015-Oct - 2017-Dec",
      "location": "Mumbai, Maharashtra",
      "responsibilities": [
        "Developed data pipelines using Hadoop MapReduce and Informatica PowerCenter, implementing Sqoop data transfers for Consulting clients requiring large-scale data migration and transformation.",
        "Built ETL workflows with Informatica mappings, Hadoop HDFS storage, and Sqoop import/export jobs for moving Consulting client data between relational databases and distributed systems.",
        "Implemented batch processing using Hadoop ecosystem, Informatica scheduling, and Sqoop incremental loads - my first time working with big data, learned distributed computing fundamentals.",
        "Created data quality frameworks with Informatica data profiling, Hadoop data validation, and Sqoop boundary queries ensuring Consulting deliverables met client accuracy requirements consistently.",
        "Collaborated with senior engineers on Hadoop cluster optimization, Informatica performance tuning, and Sqoop parallel execution for improving Consulting project data processing speeds significantly.",
        "Developed Informatica reusable transformations, Hadoop custom mappers, and Sqoop custom connectors for standardizing Consulting data integration patterns across multiple client engagements efficiently.",
        "Assisted in migrating legacy systems using Informatica workflows, Hadoop data lakes, and Sqoop bulk transfers helping Consulting clients modernize their data infrastructure cost-effectively.",
        "Supported production deployments of Hadoop jobs, Informatica workflows, and Sqoop scripts - initially struggled with debugging distributed systems but gained valuable troubleshooting experience."
      ],
      "environment": [
        "Hadoop, Informatica, Sqoop, HDFS, MapReduce, Hive, Java, SQL, Oracle, Shell Scripting"
      ]
    }
  ],
  "education": [
    {
      "institution": "KITS",
      "degree": "B.Tech",
      "field": "Computer Science",
      "year": "2015"
    }
  ],
  "certifications": [
    "Microsoft Certified: Azure Data Engineer Associate",
    "Microsoft Certified: Azure AI Engineer Associate",
    "AWS Certified Machine Learning Engineer – Associate",
    "Salesforce Certified Salesforce Developer PD1"
  ]
}