{
  "name": "Yallaiah Onteru",
  "title": "Data Center Fiber & Cabling Technician",
  "contact": {
    "email": "yonteru.dev.ai@gmail.com",
    "phone": "4142750857",
    "portfolio": "",
    "linkedin": "",
    "github": ""
  },
  "professional_summary": [
    "Hands-on Data Center Fiber & Cabling Technician with several years of experience working in live data center environments supporting fiber and copper infrastructure.",
    "Skilled in inspecting, cleaning, installing, labeling, and organizing fiber optic and CAT6 cabling while following strict customer standards and safety guidelines.",
    "Comfortable working with pre-terminated fiber, cabling matrices, and client-defined labeling schemas.",
    "Known for being detail-oriented, dependable, and able to work independently or alongside lead technicians and supervisors to deliver clean, well-organized cabling solutions on time."
  ],
  "core_skills": [
    "Cable Labeling using Flag Labelers",
    "Client Cabling Matrix & Labeling Schema Compliance",
    "CAT6 / Copper Cabling",
    "Fiber Optic Cabling (Pre-terminated)",
    "Overhead Ladder Racks, Trays & Existing Pathways",
    "Cable Routing, Dressing & Securing",
    "Fiber Inspection & Cleaning",
    "Troubleshooting & Basic Fiber Testing",
    "Cable Management & Documentation",
    "Data Center Safety Standards",
    "Re-termination & Repatching"
  ],
  "daily_activities": [
    "Inspecting and cleaning fiber connectors",
    "Installing fiber per client cabling matrix",
    "Labeling cables on both ends",
    "Troubleshooting, repatching and re-termination",
    "Dressing and securing cables for airflow and bend radius"
  ],
  "experience": [
    {
      "role": "Fiber Technician",
      "client": "Equinix Data Center",
      "duration": "Jan 2020 – Present",
      "location": "USA",
      "responsibilities": [
        "Inspected and cleaned fiber optic cables using approved fiber inspection probes and cleaning kits to ensure optimal signal quality and connection reliability.",
        "Installed pre-terminated fiber cables according to customer cabling matrices, ensuring compliance with client-specific labeling schemas and technical specifications.",
        "Labeled fiber cables on both ends using flag labelers, maintaining accurate documentation and traceability for all installed infrastructure.",
        "Routed cabling through overhead ladder racks and trays while maintaining proper bend radius and cable management standards for airflow optimization.",
        "Troubleshot, tested, and re-terminated fiber patch cables (no splicing) to resolve connectivity issues and maintain network uptime in live data center environments.",
        "Secured and dressed fiber and CAT6 cabling to ensure clean, organized installations that comply with data center aesthetic and operational standards.",
        "Assisted lead technicians and supervisors with complex installations, learning advanced techniques and contributing to team efficiency on large-scale projects.",
        "Followed all data center safety and quality standards including hot aisle protocols, equipment handling procedures, and customer access policies."
      ],
      "environment": [
        "Fiber Optic Cabling",
        "CAT6 Copper Cabling",
        "Pre-terminated Fiber",
        "Flag Labelers",
        "Fiber Inspection Probes",
        "Cleaning Kits",
        "Overhead Ladder Racks",
        "Cable Management Systems",
        "Cabling Matrices",
        "Data Center Infrastructure"
      ]
    },
    {
      "role": "Structured Cabling Technician",
      "client": "Digital Realty Data Center",
      "duration": "Sep 2018 – Dec 2019",
      "location": "India",
      "responsibilities": [
        "Supported structured cabling installations (fiber & CAT6) for data center network infrastructure projects across multiple colocation facilities.",
        "Routed and secured cables through racks and conduits following industry best practices and client specifications for data center installations.",
        "Conducted basic cable testing using network testing equipment to verify connectivity and signal integrity after installation.",
        "Assisted with labeling and documentation of installed cables, maintaining accurate records for client handover and future maintenance.",
        "Maintained organized cabling layouts in server rooms and network closets, ensuring proper cable management and accessibility for future modifications."
      ],
      "environment": [
        "Fiber Optic Cabling",
        "CAT6 Structured Cabling",
        "Cable Testing Equipment",
        "Server Racks",
        "Conduit Systems",
        "Network Documentation",
        "Data Center Infrastructure",
        "Colocation Facilities"
      ]
    }
  ],
  "education": [
    {
      "institution": "KITS",
      "degree": "B.Tech",
      "field": "Computer Science",
      "year": "2015"
    }
  ],
  "certifications": []
}