{
  "name": "Preethi Reddy",
  "title": "Sr SDET QA Engineer",
  "contact": {
    "email": "rpreethi1104@gmail.com",
    "phone": "+1 (314) 312-3188",
    "portfolio": "",
    "linkedin": "",
    "github": ""
  },
  "professional_summary": [
    "Possess 8 years of experience in manual and automated testing across Healthcare, Government, Banking, and Consulting domains with expertise in retail and restaurant transaction systems including POS, mobile wallets, and payment gateways.",
    "Validated iOS and Android mobile applications using Xcode, Logcat, Charles Proxy, and Fiddler to inspect HTTP traffic, analyze stack traces, and debug complex transaction flows for seamless omnichannel commerce experiences.",
    "Created comprehensive test plans, test cases, and test scripts for functional testing, regression testing, integration testing, and system testing using JIRA and TestRail to track defects and ensure end-to-end transaction accuracy.",
    "Executed manual QA testing for point of sales systems validating payment gateway integrations including credit, debit, Apple Pay, Google Pay, Samsung Pay, and QR code scanning to ensure PCI-DSS compliance and secure customer data handling.",
    "Performed mobile app testing across multiple device configurations using Android Debug Bridge for device debugging and Android Studio to validate retail transaction flows, inventory sync, loyalty program accrual, and receipt generation.",
    "Conducted exploratory testing, smoke testing, and sanity testing to uncover edge cases in restaurant transaction flows including order modification, split payments, tip handling, void transactions, and refund workflows under various network conditions.",
    "Collaborated with developers, product managers, and operations teams during Agile sprint planning and daily standups to reproduce bugs, document findings in detailed test reports, and recommend improvements for transaction reliability.",
    "Validated backend APIs using Postman for payment processing flows including authorization, capture, void, and refund scenarios while verifying JSON and XML response formats to ensure proper ERP and back-office integration.",
    "Tested user acceptance scenarios for customer profile features including saved payment methods, order history, push notifications, biometric authentication with Face ID and Touch ID, and offline mode functionality for uninterrupted service.",
    "Analyzed crash reports using Crashlytics and Firebase to identify app responsiveness issues, then coordinated with development teams to retest fixes and ensure stable builds were deployed through TestFlight and Play Console beta platforms.",
    "Verified accessibility compliance using VoiceOver and TalkBack screen readers, validated WCAG standards, and tested responsive design across Chrome, Safari, Firefox, and Edge browsers to ensure consistent user experience on mobile, tablet, and desktop.",
    "Supported automation frameworks with Selenium and Appium to assist in automating repetitive test scenarios while maintaining manual test coverage for complex retail workflows including discount promotions, tax calculations, and gift card redemptions.",
    "Monitored transaction accuracy during peak hours by validating data masking, mock data creation, and session management scenarios including login, logout, and timeout flows to maintain financial integrity and customer trust in digital commerce platforms.",
    "Ensured compliance with GDPR and CCPA privacy regulations by testing age verification for alcohol and tobacco purchases, employee discount validation, and secure HTTPS connections with certificate pinning across web and mobile channels."
  ],
  "technical_skills": {
    "Manual Testing Expertise": [
      "Manual QA Testing",
      "Test Plan Development",
      "Test Case Creation",
      "Test Script Execution",
      "Functional Testing",
      "Regression Testing",
      "Integration Testing",
      "System Testing",
      "Transaction Testing",
      "Defect Logging",
      "Defect Tracking",
      "Test Reporting",
      "Exploratory Testing",
      "Smoke Testing",
      "Sanity Testing"
    ],
    "Mobile Testing Platforms": [
      "iOS Testing",
      "Android Testing",
      "Mobile App Testing",
      "Xcode",
      "Logcat",
      "Android Debug Bridge",
      "Android Studio",
      "TestFlight",
      "Play Console",
      "Device Fragmentation Testing"
    ],
    "Debugging & Proxy Tools": [
      "Charles Proxy",
      "Fiddler",
      "StackTrace Analysis",
      "Postman",
      "REST API Testing",
      "JSON Validation",
      "XML Validation",
      "Network Simulation"
    ],
    "Test Management Tools": [
      "JIRA",
      "TestRail",
      "Git",
      "Agile Methodology",
      "Scrum",
      "CI/CD Pipeline Integration"
    ],
    "Payment & Transaction Systems": [
      "Payment Gateway Testing",
      "Point of Sales Systems",
      "PCI-DSS Compliance",
      "Mobile Wallet Protocols",
      "Apple Pay",
      "Google Pay",
      "Samsung Pay",
      "QR Code Testing",
      "Barcode Scanning",
      "Payment Processing",
      "Authorization Flows",
      "Capture Flows",
      "Void Transactions",
      "Refund Flows"
    ],
    "Retail & Restaurant Workflows": [
      "Retail Transaction Flows",
      "Restaurant Transaction Flows",
      "POS Systems",
      "Inventory Sync",
      "Loyalty Program Testing",
      "Discount Testing",
      "Promotion Testing",
      "Tax Calculation Validation",
      "Receipt Generation",
      "Returns Testing",
      "Split Payments",
      "Tip Handling",
      "Order Modification",
      "Back-office Integration"
    ],
    "Security & Compliance": [
      "PCI-DSS",
      "GDPR",
      "CCPA",
      "Security Testing",
      "Authentication Testing",
      "Authorization Testing",
      "Data Encryption",
      "Session Management",
      "HTTPS Validation",
      "Certificate Pinning"
    ],
    "Cross-Platform Testing": [
      "Browser Testing",
      "Chrome",
      "Safari",
      "Firefox",
      "Edge",
      "Responsive Design Testing",
      "Cross-browser Compatibility",
      "Accessibility Testing",
      "WCAG Compliance",
      "Localization Testing"
    ],
    "Quality Assurance Methodologies": [
      "User Acceptance Testing",
      "Edge Case Testing",
      "Boundary Testing",
      "Negative Scenarios",
      "Test Environment Management",
      "Data Masking",
      "Mock Data Creation"
    ],
    "Monitoring & Reporting Tools": [
      "Crashlytics",
      "Sentry",
      "Firebase",
      "Analytics Validation",
      "Event Logging Verification"
    ],
    "Automation Support": [
      "Selenium",
      "Appium",
      "SQL",
      "Test Automation Frameworks"
    ],
    "Additional Testing Capabilities": [
      "Biometric Authentication",
      "Face ID",
      "Touch ID",
      "VoiceOver",
      "TalkBack",
      "Dark Mode Testing",
      "Offline Mode Testing",
      "Geolocation Testing",
      "Push Notifications",
      "SMS Testing",
      "Email Triggers"
    ]
  },
  "experience": [
    {
      "role": "Sr SDET QA Engineer",
      "client": "Molina Healthcare",
      "duration": "2023-Jun - Present",
      "location": "",
      "responsibilities": [
        "Design comprehensive test plans for healthcare transaction systems integrating HIPAA compliance requirements with point of sales systems, mobile wallets, and payment gateways to validate patient billing accuracy and secure PHI handling across web and mobile platforms.",
        "Execute manual QA testing using Charles Proxy and Fiddler to inspect HTTP traffic for iOS and Android healthcare applications, identifying authorization and capture flow issues in payment processing that affected claims submission and reduced transaction errors.",
        "Utilize Xcode and Logcat to analyze stack traces and debug complex integration testing scenarios between healthcare ERP systems and retail pharmacy POS terminals, ensuring FDA regulatory compliance for prescription processing and insurance verification workflows.",
        "Build test cases in JIRA and TestRail covering functional testing for patient portal features including appointment scheduling, lab results access, and telehealth video consultations while validating mobile wallet protocols for copayment collection through Apple Pay and Google Pay.",
        "Perform regression testing across Android Debug Bridge connected devices to validate healthcare loyalty program accrual, HSA and FSA payment method handling, and automated refund workflows for cancelled appointments while maintaining GDPR and CHIP compliance standards.",
        "Coordinate with development teams during Agile sprint planning to reproduce defects in restaurant-style cafeteria transaction flows within hospital facilities, testing order modification, split payments between insurance and patient responsibility, and tip handling for food service staff.",
        "Validate backend APIs using Postman for healthcare claim adjudication systems, verifying JSON response formats for eligibility checks, prior authorization requests, and EOB generation while ensuring proper integration with Vertex AI for fraud detection and anomaly monitoring.",
        "Conduct exploratory testing on iOS and Android mobile apps to uncover edge cases in patient medication reminders, prescription refill notifications, and biometric authentication using Face ID and Touch ID for secure access to sensitive health records and billing information.",
        "Test system testing scenarios for omnichannel healthcare commerce including web portals, mobile apps, and in-clinic kiosks to ensure consistent user experience across platforms while validating receipt generation for itemized billing statements and tax-exempt medical purchases.",
        "Analyze crash reports from Crashlytics and Firebase to identify performance issues during peak appointment scheduling hours, then retest fixes to ensure app responsiveness improvements and reduced session timeout incidents for patient-facing applications.",
        "Verify accessibility compliance using VoiceOver and TalkBack screen readers for healthcare mobile applications, ensuring WCAG standards are met for elderly and disabled patients while testing responsive design across tablet devices used by clinical staff for bedside charting.",
        "Support test automation frameworks with Selenium and Appium to automate repetitive smoke testing and sanity testing cycles for healthcare transaction systems, allowing manual focus on complex scenarios like multi-step prior authorization approvals and specialty pharmacy workflows.",
        "Monitor transaction accuracy for healthcare payment processing by validating data masking of PHI in test environments, creating mock patient data for boundary testing, and verifying session management security to prevent unauthorized access to billing and claims systems.",
        "Document detailed test reports recommending improvements for healthcare transaction reliability including enhanced error handling for declined payments, clearer messaging for claim denials, and streamlined void transaction processes for cancelled procedures while maintaining audit trails."
      ],
      "environment": [
        "iOS Testing",
        "Android Testing",
        "Xcode",
        "Logcat",
        "Charles Proxy",
        "Fiddler",
        "Android Debug Bridge",
        "Android Studio",
        "JIRA",
        "TestRail",
        "Postman",
        "Manual QA Testing",
        "Point of Sales Systems",
        "Payment Gateway Testing",
        "Mobile Wallet Protocols",
        "Apple Pay",
        "Google Pay",
        "PCI-DSS",
        "HIPAA",
        "GDPR",
        "CHIP",
        "FDA",
        "Vertex AI",
        "Crashlytics",
        "Firebase",
        "Selenium",
        "Appium",
        "VoiceOver",
        "TalkBack",
        "WCAG",
        "TestFlight",
        "Play Console",
        "Agile",
        "Scrum"
      ]
    },
    {
      "role": "Sr QA Automation Engineer",
      "client": "State of Washington",
      "duration": "2021-Sep - 2023-May",
      "location": "",
      "responsibilities": [
        "Developed test plans for government service portals validating point of sales systems used for permit fees, license renewals, and public records requests while ensuring transaction testing covered payment gateway integrations with state banking systems and secure data handling.",
        "Executed functional testing using Android Debug Bridge and Android Studio to validate mobile app testing scenarios for iOS and Android applications used by field inspectors and public safety officers to process fines, citations, and parking violations with mobile wallet support.",
        "Applied Charles Proxy and Fiddler to inspect HTTP traffic and debug integration testing issues between government ERP systems and retail-style service centers where citizens paid for vehicle registrations, hunting licenses, and park passes through POS terminals and web portals.",
        "Constructed test cases in JIRA and TestRail for regression testing of government transaction flows including split payments between multiple funding sources, tax calculation validation for sales tax exemptions on certain services, and receipt generation for FOIA request processing fees.",
        "Confirmed payment processing accuracy for government services by validating authorization, capture, void, and refund flows using Postman REST API testing while verifying JSON and XML response formats matched specifications for integration with legacy mainframe systems and modern cloud platforms.",
        "Tracked defects through resolution using defect logging and defect tracking processes in JIRA, collaborating with developers during daily standups to reproduce stack trace analysis errors in mobile applications used for emergency alert systems and public service notifications.",
        "Assessed system testing scenarios for government omnichannel commerce including web portals, mobile apps, and in-person kiosks at DMV and licensing offices to ensure consistent citizen experience while validating QR code scanning for digital ID verification and barcode scanning for document processing.",
        "Investigated exploratory testing opportunities to uncover edge cases in government loyalty program testing for frequent service users, discount validation for senior citizens and veterans, and promotion testing for reduced fees during special registration periods while maintaining audit compliance.",
        "Reviewed accessibility testing using VoiceOver and TalkBack to ensure government mobile applications met WCAG compliance standards for citizens with disabilities, testing responsive design across multiple device configurations including tablets used by social workers and case managers.",
        "Facilitated smoke testing and sanity testing after each build deployment to verify critical government transaction paths remained functional, including order modification for service requests, session management for secure citizen portals, and offline mode testing for field workers in remote areas."
      ],
      "environment": [
        "Android Testing",
        "iOS Testing",
        "Android Debug Bridge",
        "Android Studio",
        "Charles Proxy",
        "Fiddler",
        "JIRA",
        "TestRail",
        "Postman",
        "REST API Testing",
        "JSON Validation",
        "XML Validation",
        "Manual QA Testing",
        "Test Plan Development",
        "Test Case Creation",
        "Functional Testing",
        "Regression Testing",
        "Integration Testing",
        "System Testing",
        "Payment Gateway Testing",
        "Point of Sales Systems",
        "Mobile Wallet Protocols",
        "QR Code Testing",
        "Barcode Scanning",
        "VoiceOver",
        "TalkBack",
        "WCAG",
        "Agile",
        "Scrum",
        "Git"
      ]
    },
    {
      "role": "Selenium Automation Engineer",
      "client": "Comerica Bank",
      "duration": "2019-Nov - 2021-Aug",
      "location": "",
      "responsibilities": [
        "Assembled test scripts for banking transaction systems validating point of sales systems used at branch locations for teller operations, merchant services, and small business banking while ensuring PCI-DSS compliance for payment gateway testing and secure card data handling.",
        "Implemented functional testing and regression testing using Selenium to validate web-based banking portals where customers processed wire transfers, bill payments, and mobile check deposits while testing integration with payment processing systems for authorization and capture flows.",
        "Configured Android Debug Bridge and Android Studio to test mobile app testing scenarios for iOS and Android banking applications, validating mobile wallet protocols including Apple Pay, Google Pay, and Samsung Pay for contactless payments at merchant POS terminals and ATMs.",
        "Populated test cases in JIRA and TestRail for integration testing of banking transaction flows including split payments for loan payments from multiple accounts, void transactions for cancelled wire transfers, and refund workflows for disputed merchant charges while maintaining detailed audit trails.",
        "Established manual QA testing processes using Charles Proxy and Fiddler to inspect HTTP traffic and debug issues in retail transaction flows for merchant services clients, validating receipt generation, tip handling for restaurant merchants, and discount validation for promotional campaigns.",
        "Examined defect tracking data to identify patterns in payment gateway failures, collaborated with backend developers to resolve stack trace analysis errors, and retested fixes to ensure transaction accuracy for high-volume processing during month-end and quarter-end banking operations.",
        "Delivered test reporting documentation for system testing scenarios covering customer profile testing including saved payment methods, order history for recurring bill payments, and session management security to prevent unauthorized access to sensitive banking data and transaction records.",
        "Assisted user acceptance testing efforts by validating exploratory testing scenarios for new banking features including biometric authentication with Face ID and Touch ID, push notifications for fraud alerts, and SMS testing for two-factor authentication during login and transaction approval processes."
      ],
      "environment": [
        "Selenium",
        "JIRA",
        "TestRail",
        "Android Debug Bridge",
        "Android Studio",
        "Charles Proxy",
        "Fiddler",
        "iOS Testing",
        "Android Testing",
        "Manual QA Testing",
        "Functional Testing",
        "Regression Testing",
        "Integration Testing",
        "System Testing",
        "Payment Gateway Testing",
        "Point of Sales Systems",
        "Mobile Wallet Protocols",
        "Apple Pay",
        "Google Pay",
        "Samsung Pay",
        "PCI-DSS",
        "REST API Testing",
        "Postman",
        "Git",
        "Agile"
      ]
    },
    {
      "role": "QA Analyst",
      "client": "Tech Mahindra",
      "duration": "2017-Apr - 2019-May",
      "location": "",
      "responsibilities": [
        "Prepared test cases for consulting client projects involving retail transaction flows and restaurant transaction flows, validating point of sales systems functionality including inventory sync, loyalty program testing, and payment gateway testing for credit, debit, and mobile wallet acceptance.",
        "Gained experience with manual QA testing using Android Debug Bridge and Logcat to debug mobile app testing scenarios on iOS and Android devices, identifying issues in order modification workflows, split payments processing, and QR code scanning for customer loyalty programs at retail locations.",
        "Completed functional testing and regression testing cycles using JIRA for defect logging and defect tracking, collaborating with development teams to reproduce bugs in transaction testing scenarios including authorization flows, capture flows, void transactions, and refund workflows for merchant clients.",
        "Participated in integration testing efforts validating backend APIs using Postman, verifying JSON response formats for payment processing systems, and ensuring proper data flow between POS terminals, inventory management systems, and back-office integration with ERP and accounting platforms.",
        "Produced test reports documenting smoke testing and sanity testing results for retail client deployments, highlighting edge cases discovered during exploratory testing of discount validation, promotion testing, tax calculation accuracy, and receipt generation for both digital and printed formats.",
        "Contributed to system testing activities for restaurant clients by validating tip handling calculations, table management workflows, kitchen display system order routing, and curbside pickup notification testing to ensure seamless customer experience across dine-in, takeout, and delivery channels."
      ],
      "environment": [
        "JIRA",
        "Android Debug Bridge",
        "Logcat",
        "Postman",
        "Manual QA Testing",
        "iOS Testing",
        "Android Testing",
        "Test Case Creation",
        "Functional Testing",
        "Regression Testing",
        "Integration Testing",
        "System Testing",
        "Payment Gateway Testing",
        "Point of Sales Systems",
        "Transaction Testing",
        "Mobile Wallet Protocols",
        "QR Code Testing",
        "Agile"
      ]
    }
  ],
  "education": [],
  "certifications": [
    "ISTQB Advanced Level Agile Technical Tester (CTAL-ATT)"
  ]
}