{
  "name": "Yallaiah Onteru",
  "title": "Senior Full-Stack AI Engineer | Azure Cloud Solutions Architect",
  "contact": {
    "email": "yonteru.ai.engineer@gmail.com",
    "phone": "7372310791",
    "portfolio": "",
    "linkedin": "Linked In",
    "github": ""
  },
  "professional_summary": [
    "Having 6 years of experience building scalable Azure cloud infrastructure storage experiences and AI-powered enterprise solutions using TypeScript, React, Python, and Java across Insurance, Technology, Transportation, and Banking domains with consistent focus on accessibility standards, security best practices, and performance optimization at enterprise scale.",
    "Delivered full-stack AI-powered systems leveraging Azure AI Services, OpenAI GPT models, and LangChain frameworks to build agentic workflows with Model Context Protocol for strategic enterprise customers, achieving seamless agent-to-agent communication and RAG implementation across globally distributed datacenters supporting millions of users with weekly release cadence.",
    "Constructed revolutionary web experiences for Azure Storage management using React, TypeScript, and Node.js with RESTful APIs, implementing continuous improvement processes and CI/CD pipelines through Azure DevOps to support agile development methodologies while embedding closely with customer teams to understand needs and guide adoption of cloud architecture patterns.",
    "Applied prompt engineering techniques and machine learning methods to fine-tune OpenAI GPT models for speech and search capabilities, integrating evaluations and model assessments with Jest testing frameworks to ensure quality across authentication and authorization implementations meeting Microsoft Cloud security screening requirements for production deployments.",
    "Integrated Azure Cognitive Services with responsive design principles to create engaging user interfaces following WCAG accessibility standards, utilizing Docker and Kubernetes for microservices architecture deployed across multiple Azure regions with monitoring and observability tools tracking performance metrics and supporting rapid learning of new concepts and technologies.",
    "Established agent communication protocols using Semantic Kernel and vector databases to power long-horizon task execution with multi-agent systems, partnering with designers and engineers from diverse backgrounds to scope work, sequence delivery, and own technical delivery from prototype to production while maintaining growth mindset and values of respect, integrity, and accountability.",
    "Configured Azure OpenAI Service integrations with LlamaIndex and Guardrails AI for tool calling and agent design patterns, removing blockers early and making trade-offs between scope, speed, and quality to protect delivery timelines while working at startup speed with resources of one of the world's largest companies to help shape the future of the world.",
    "Automated CI/CD pipelines with GitHub Actions for continuous deployment of LLM-powered AI agents using Python and Node.js, codifying working patterns into reusable tools and playbooks that accelerated team velocity, demonstrating strong teamwork in dynamic customer-focused collaborative environment with ability to develop strong relationships with peers and partners across Microsoft.",
    "Deployed Azure Storage services with HTML and CSS foundational implementations supporting cloud storage management solutions, thriving in environment requiring thoughtful engineering and ability to focus on outcomes that matter while collaborating to realize shared goals and innovate to empower others through clarity and follow-through on delivery commitments.",
    "Enhanced API design with TypeScript and JavaScript to build scalable backend services integrated with Azure AI Services for generative AI applications, adjusting plans to protect delivery and embedding problem-solving capabilities to guide customer adoption through technical leadership and self-direction in owning delivery across multiple deployments globally.",
    "Migrated legacy systems to modern Azure cloud infrastructure using Git version control and agile sprints, contributing directly to code when progress depended on it and keeping teams moving through clear communication while deeply committed to understanding and meeting customers' needs with customer empathy and knowledge sharing.",
    "Optimized performance of React applications with TypeScript using lazy loading and code splitting techniques, implementing security best practices for authentication flows and ensuring applications met accessibility requirements through semantic HTML structure and ARIA attributes with continuous evaluation and improvement across development lifecycle.",
    "Streamlined agent-to-agent communication workflows using Model Context Protocol and Agents SDK for prompt orchestration, facilitating retrieval-augmented generation implementations that improved response accuracy while maintaining adaptability to rapidly changing requirements and demonstrating accountability in delivering revolutionary experiences at scale.",
    "Collaborated across Microsoft partnerships to implement agentic workflows with Java backend services, Azure Storage APIs, and Speech services, creating inclusive culture where everyone can thrive at work and beyond while being passionate about products and maintaining mission to empower every person and organization on planet to achieve more."
  ],
  "technical_skills": {
    "Programming Languages": [
      "Python",
      "Java",
      "JavaScript",
      "TypeScript",
      "HTML",
      "CSS"
    ],
    "Frontend Frameworks": [
      "React",
      "Redux",
      "Material-UI",
      "Responsive Design",
      "WCAG Accessibility Standards"
    ],
    "Backend Technologies": [
      "Node.js",
      "RESTful APIs",
      "Express.js",
      "Microservices Architecture"
    ],
    "Cloud Platforms": [
      "Azure",
      "Azure AI Services",
      "Azure OpenAI Service",
      "Azure Storage Services",
      "Azure Cognitive Services",
      "Azure DevOps"
    ],
    "AI & Machine Learning": [
      "Generative AI",
      "OpenAI GPT models",
      "LLMs",
      "Machine Learning techniques",
      "Model Fine Tuning",
      "Evaluations",
      "Prompt Engineering"
    ],
    "LLM Frameworks & Agentic Systems": [
      "LangChain",
      "LangGraph",
      "LlamaIndex",
      "Semantic Kernel",
      "Guardrails AI",
      "Model Context Protocol (MCP)",
      "Agents SDK",
      "Tool Calling",
      "Agentic Workflows",
      "Agent-to-Agent Communication",
      "Agent Communication Protocols"
    ],
    "LLM Application Patterns": [
      "LLM-powered AI Agents",
      "Prompt Orchestration",
      "RAG (Retrieval-Augmented Generation)",
      "Long-horizon Task Execution",
      "Agent Design Patterns",
      "Multi-agent Systems"
    ],
    "AI Services": [
      "Speech",
      "Search",
      "Vector Databases",
      "Azure Cognitive Search"
    ],
    "Testing Frameworks": [
      "Jest",
      "Unit Testing",
      "Integration Testing",
      "Test Automation"
    ],
    "DevOps & CI/CD": [
      "CI/CD Pipelines",
      "Azure DevOps",
      "GitHub Actions",
      "Docker",
      "Kubernetes",
      "Continuous Improvement Processes"
    ],
    "Development Methodologies": [
      "Agile Development Methodologies",
      "Scrum",
      "Weekly Release Cadence"
    ],
    "Version Control": [
      "Git",
      "GitHub",
      "Azure Repos"
    ],
    "Security & Compliance": [
      "Authentication",
      "Authorization",
      "Security Best Practices",
      "Microsoft Cloud Security Screening"
    ],
    "Architecture & Design": [
      "Cloud Architecture Patterns",
      "API Design Principles",
      "Performance Optimization",
      "Scalability Solutions"
    ],
    "Monitoring & Observability": [
      "Azure Monitor",
      "Application Insights",
      "Logging",
      "Monitoring Tools"
    ]
  },
  "experience": [
    {
      "client": "Northwestern Mutual",
      "role": "AI Developer",
      "duration": "2025-Feb - Present",
      "location": "Irving, Texas.",
      "responsibilities": [
        "Built full-stack AI-powered insurance advisory system using React, TypeScript, and Python with Azure AI Services, implementing OpenAI GPT models and agentic workflows through LangChain and LangGraph to automate policy recommendation engine that processes customer risk profiles with agent-to-agent communication via Model Context Protocol, reducing manual review time while ensuring compliance with insurance regulations and accessibility standards.",
        "Integrated prompt engineering techniques with Azure OpenAI Service to develop LLM-powered AI agents using Semantic Kernel and Guardrails AI for tool calling, creating multi-agent systems that handle insurance claims processing through agent design patterns with RAG implementation querying vector databases for policy documentation, achieving improved accuracy in underwriting decisions with continuous improvement processes.",
        "Deployed CI/CD pipelines using Azure DevOps and GitHub Actions with Docker containerization for Node.js backend services and React frontend applications, establishing weekly release cadence across globally distributed datacenters while implementing Jest testing frameworks to validate agentic workflows, authentication mechanisms, and RESTful APIs supporting millions of insurance policyholders with performance optimization and security best practices.",
        "Configured Azure Storage services infrastructure to manage policyholder documents and claims data at scale, utilizing TypeScript and JavaScript to build responsive design interfaces with HTML and CSS following WCAG accessibility requirements, while partnering with customer teams to understand insurance domain needs and guide adoption of cloud architecture patterns with Git version control for collaborative development.",
        "Enhanced machine learning models for speech recognition in customer service applications using Azure Cognitive Services, applying model fine-tuning techniques and evaluations to improve natural language understanding of insurance terminology, while collaborating with designers and engineers from diverse backgrounds using agile development methodologies to deliver revolutionary web experiences for Azure Storage management.",
        "Automated long-horizon task execution workflows using LlamaIndex, LangGraph, and Agents SDK for prompt orchestration, implementing agent communication protocols that coordinate between claims validation agents, fraud detection systems, and policy administration platforms with retrieval-augmented generation accessing insurance knowledge bases, demonstrating strong teamwork in dynamic customer-focused collaborative environment.",
        "Established microservices architecture with Java backend services integrated with Azure AI Services for generative AI capabilities, designing RESTful APIs that support search functionality across policy databases while maintaining security through proper authentication and authorization implementations meeting Microsoft Cloud security screening requirements, showing growth mindset in rapidly learning new concepts and technologies.",
        "Optimized React application performance using TypeScript with code splitting and lazy loading techniques, implementing monitoring and observability tools through Azure Monitor to track user interactions with insurance portal interfaces, while embedding closely with customer teams to scope work and sequence delivery from prototype to production with clarity and follow-through.",
        "Streamlined agent-to-agent communication for insurance workflow automation using Model Context Protocol and LangGraph orchestration, developing Python scripts that coordinate interactions between underwriting agents, compliance verification systems, and risk assessment modules with tool calling patterns, removing blockers early and making trade-offs between scope, speed, and quality to protect delivery timelines.",
        "Applied continuous improvement processes to Azure cloud infrastructure supporting insurance operations, utilizing Node.js and Python to build API integrations that connect legacy policy administration systems with modern AI-powered capabilities through agentic workflows, thriving in environment requiring thoughtful engineering and ability to focus on outcomes that matter.",
        "Integrated vector databases with Azure Cognitive Search to power semantic search capabilities across insurance documentation, implementing prompt engineering strategies for OpenAI GPT models that generate personalized policy explanations using LangChain frameworks, while collaborating to realize shared goals and innovate to empower insurance advisors with AI assistance.",
        "Transformed insurance claims processing using multi-agent systems with agent design patterns coordinating between document extraction agents, validation workflows, and approval routing logic, leveraging LLM-powered AI agents built with Semantic Kernel and Azure OpenAI Service, demonstrating customer empathy by deeply understanding and meeting insurance customers' needs.",
        "Validated agentic workflow implementations through comprehensive Jest testing coverage for React components and Node.js services, ensuring security best practices in authentication flows and API design while maintaining accessibility standards across web experiences, contributing directly to code when progress depended on it and keeping teams moving through clear communication.",
        "Facilitated adoption of Azure Storage services for insurance document management at enterprise scale, implementing cloud architecture patterns with Docker and Kubernetes orchestration for deployment across multiple regions, codifying working patterns into reusable tools and playbooks while maintaining values of respect, integrity, and accountability in technical leadership."
      ],
      "environment": [
        "Python",
        "TypeScript",
        "React",
        "JavaScript",
        "Java",
        "Node.js",
        "HTML",
        "CSS",
        "Azure",
        "Azure AI Services",
        "Azure OpenAI Service",
        "Azure Storage Services",
        "Azure Cognitive Services",
        "Azure DevOps",
        "Azure Monitor",
        "OpenAI GPT models",
        "LangChain",
        "LangGraph",
        "LlamaIndex",
        "Semantic Kernel",
        "Guardrails AI",
        "Model Context Protocol (MCP)",
        "Agents SDK",
        "Tool Calling",
        "LLM-powered AI Agents",
        "Agentic Workflows",
        "Prompt Orchestration",
        "RAG (Retrieval-Augmented Generation)",
        "Long-horizon Task Execution",
        "Agent Design Patterns",
        "Multi-agent Systems",
        "Agent-to-Agent Communication",
        "Agent Communication Protocols",
        "Vector Databases",
        "Generative AI",
        "Machine Learning techniques",
        "Model Fine Tuning",
        "Evaluations",
        "Prompt Engineering",
        "Speech",
        "Search",
        "Jest",
        "RESTful APIs",
        "CI/CD Pipelines",
        "GitHub Actions",
        "Docker",
        "Kubernetes",
        "Git",
        "Agile Development Methodologies",
        "Continuous Improvement Processes",
        "Authentication",
        "Authorization",
        "Security Best Practices",
        "Cloud Architecture Patterns",
        "Performance Optimization",
        "WCAG Accessibility Standards",
        "Responsive Design",
        "Microservices Architecture"
      ]
    },
    {
      "client": "Spartex AI",
      "role": "LLM Developer",
      "duration": "2024-Jun - 2025-Feb",
      "location": "Remote",
      "responsibilities": [
        "Constructed enterprise-grade conversational AI platform using Python, TypeScript, and React with Azure OpenAI Service, implementing agentic workflows through LangChain, LangGraph, and Model Context Protocol to enable agent-to-agent communication between customer support agents, knowledge retrieval systems, and task execution modules, leveraging prompt engineering and OpenAI GPT models with RAG architecture accessing vector databases for technology documentation.",
        "Architected multi-agent systems using LlamaIndex, LangGraph, and Agents SDK for tool calling capabilities, developing agent design patterns that coordinated long-horizon task execution across document processing agents, code generation workflows, and quality validation systems, applying machine learning techniques and model fine-tuning with continuous evaluations through Jest testing frameworks ensuring security best practices and authentication mechanisms.",
        "Implemented CI/CD pipelines with Azure DevOps and Docker containerization for Node.js microservices and React frontend applications, establishing agile development methodologies with weekly releases deployed across Azure cloud infrastructure using Kubernetes orchestration, while integrating Azure AI Services for speech recognition and search functionality with HTML and CSS responsive design following WCAG accessibility standards.",
        "Developed RESTful APIs using JavaScript and Java backend services connected to Azure Storage services, implementing cloud architecture patterns that supported scalability requirements for technology platform serving distributed user base, utilizing Git version control and collaborating with cross-functional teams to remove blockers and maintain continuous improvement processes throughout development lifecycle.",
        "Customized LLM-powered AI agents with Semantic Kernel and Guardrails AI for prompt orchestration workflows, implementing retrieval-augmented generation that queried Azure Cognitive Search indexes and vector databases to generate contextually relevant responses, applying prompt engineering strategies to fine-tune OpenAI GPT models for technology domain-specific terminology and improving response accuracy through systematic evaluations.",
        "Assembled agent communication protocols enabling seamless coordination between Python-based data processing agents and TypeScript-based UI interaction handlers, utilizing Model Context Protocol and LangGraph for message passing and state management across multi-agent systems, while implementing monitoring and observability through Azure Monitor to track agent performance metrics and interaction patterns with performance optimization techniques.",
        "Designed full-stack applications combining React components with Node.js backends, leveraging Azure AI Services for generative AI capabilities integrated with agentic workflows that automated content generation, code review processes, and documentation creation tasks, ensuring API design principles supported extensibility while maintaining security through proper authorization controls meeting compliance requirements.",
        "Produced reusable component libraries in TypeScript and React following accessibility guidelines, implementing responsive design patterns with HTML and CSS that adapted to various device form factors, while utilizing Jest for comprehensive test coverage validating agent interactions, authentication flows, and RESTful API contracts with focus on quality and maintainability.",
        "Executed performance optimization initiatives for LangChain-based agentic systems, tuning prompt templates and retrieval strategies to reduce latency in agent-to-agent communication workflows, while applying machine learning techniques to improve semantic search accuracy in vector database queries and implementing caching strategies in Azure Storage services to enhance overall system responsiveness.",
        "Aligned technology platform architecture with Azure cloud infrastructure best practices, utilizing Docker and Kubernetes for containerized deployments across multiple regions, implementing CI/CD automation through GitHub Actions for continuous delivery, and establishing monitoring frameworks that tracked application health, agent workflow execution metrics, and user engagement patterns across distributed systems."
      ],
      "environment": [
        "Python",
        "TypeScript",
        "React",
        "JavaScript",
        "Java",
        "Node.js",
        "HTML",
        "CSS",
        "Azure",
        "Azure AI Services",
        "Azure OpenAI Service",
        "Azure Storage Services",
        "Azure Cognitive Services",
        "Azure Cognitive Search",
        "Azure DevOps",
        "Azure Monitor",
        "OpenAI GPT models",
        "LangChain",
        "LangGraph",
        "LlamaIndex",
        "Semantic Kernel",
        "Guardrails AI",
        "Model Context Protocol (MCP)",
        "Agents SDK",
        "Tool Calling",
        "LLM-powered AI Agents",
        "Agentic Workflows",
        "Prompt Orchestration",
        "RAG (Retrieval-Augmented Generation)",
        "Long-horizon Task Execution",
        "Agent Design Patterns",
        "Multi-agent Systems",
        "Agent-to-Agent Communication",
        "Agent Communication Protocols",
        "Vector Databases",
        "Generative AI",
        "Machine Learning techniques",
        "Model Fine Tuning",
        "Evaluations",
        "Prompt Engineering",
        "Speech",
        "Search",
        "Jest",
        "RESTful APIs",
        "CI/CD Pipelines",
        "GitHub Actions",
        "Docker",
        "Kubernetes",
        "Git",
        "Agile Development Methodologies",
        "Continuous Improvement Processes",
        "Authentication",
        "Authorization",
        "Security Best Practices",
        "Cloud Architecture Patterns",
        "Performance Optimization",
        "WCAG Accessibility Standards",
        "Responsive Design",
        "Microservices Architecture",
        "API Design Principles"
      ]
    },
    {
      "client": "Ola",
      "role": "Machine Learning Engineer",
      "duration": "2020-Oct - 2023-Sep",
      "location": "Banglore, India.",
      "responsibilities": [
        "Developed real-time demand forecasting system using Python and machine learning techniques on AWS cloud infrastructure, implementing predictive models that analyzed historical ride patterns and transportation metrics to optimize driver allocation across urban zones, utilizing RESTful APIs built with Node.js and integrating React dashboards with TypeScript for operations monitoring with responsive design principles.",
        "Generated dynamic pricing algorithms leveraging machine learning models trained on transportation demand data, implementing Python-based services deployed through AWS Lambda with CI/CD pipelines using Git version control, while building JavaScript frontend components that visualized pricing zones and surge patterns for operations teams with HTML and CSS styling following accessibility guidelines.",
        "Maintained AWS cloud architecture supporting transportation platform serving millions of daily riders, implementing microservices with Java backend components that processed ride requests, matched drivers to passengers, and calculated optimal routes, while utilizing continuous improvement processes through agile development methodologies and weekly deployment cycles with performance optimization focus.",
        "Collaborated with cross-functional teams to implement search functionality using AWS Elasticsearch for driver and rider matching algorithms, developing RESTful API endpoints with Node.js that handled geospatial queries and real-time availability updates, while ensuring security best practices through authentication and authorization mechanisms protecting user transportation data.",
        "Created machine learning pipelines for driver behavior analysis using Python and AWS SageMaker, applying model fine-tuning techniques to predict arrival times and service quality metrics, while building React-based reporting dashboards with TypeScript that provided insights into transportation network efficiency and operational bottlenecks with responsive layouts.",
        "Utilized AWS storage services including S3 and DynamoDB to manage transportation telemetry data at scale, implementing data processing workflows that extracted ride patterns and customer preferences, while developing monitoring solutions that tracked system health and alerted on anomalies affecting transportation service availability.",
        "Assisted in migration of legacy transportation systems to AWS cloud platform, implementing containerization with Docker and orchestration strategies that supported horizontal scaling during peak demand periods, while maintaining API design principles ensuring backward compatibility and minimal service disruption for active ride sessions.",
        "Supported development of mobile-responsive interfaces using React, JavaScript, and CSS that enabled drivers to accept rides and navigate routes efficiently, implementing Jest testing frameworks validating component behavior and API integrations, while collaborating with teams to optimize user experience and reduce friction in transportation workflows."
      ],
      "environment": [
        "Python",
        "JavaScript",
        "TypeScript",
        "React",
        "Java",
        "Node.js",
        "HTML",
        "CSS",
        "AWS",
        "AWS Lambda",
        "AWS SageMaker",
        "AWS S3",
        "AWS DynamoDB",
        "AWS Elasticsearch",
        "Machine Learning techniques",
        "Model Fine Tuning",
        "RESTful APIs",
        "Git",
        "CI/CD Pipelines",
        "Docker",
        "Jest",
        "Agile Development Methodologies",
        "Continuous Improvement Processes",
        "Authentication",
        "Authorization",
        "Security Best Practices",
        "Performance Optimization",
        "Responsive Design",
        "Microservices Architecture",
        "API Design Principles"
      ]
    },
    {
      "client": "ICICI Bank",
      "role": "Azure Data Engineer",
      "duration": "2019-Feb - 2020-Sep",
      "location": "Mumbai, India.",
      "responsibilities": [
        "Delivered Azure-based data warehousing solution for banking transaction processing using Python and Azure Storage services, implementing ETL pipelines that ingested customer financial data from multiple sources, while building RESTful APIs with Node.js enabling frontend applications to query account information with proper authentication and authorization controls meeting banking security compliance requirements.",
        "Processed large-scale banking datasets using Azure Data Factory and Python scripts, implementing data transformation logic that standardized transaction records and customer profiles across legacy systems, while developing React dashboards with TypeScript and JavaScript that visualized financial metrics for risk management teams with HTML and CSS responsive design.",
        "Secured banking data infrastructure on Azure cloud platform implementing encryption at rest and in transit, configuring authentication mechanisms for data access with role-based authorization policies, while utilizing Git for version control and establishing CI/CD pipelines through Azure DevOps enabling automated testing with Jest frameworks and continuous deployment following agile development methodologies.",
        "Assisted analytics teams by building Python-based reporting tools that extracted insights from banking transaction patterns, implementing machine learning techniques for fraud detection scoring, while creating RESTful API endpoints exposing aggregated metrics to Java-based banking applications with performance optimization ensuring sub-second query response times.",
        "Contributed to migration of on-premises banking databases to Azure cloud infrastructure, implementing data replication strategies and backup procedures ensuring compliance with financial regulations, while developing monitoring solutions tracking data pipeline health and alerting on failures affecting critical banking operations with focus on security best practices.",
        "Supported development of customer-facing banking portal using React and TypeScript with responsive design principles, implementing frontend components that displayed account balances and transaction histories retrieved through Node.js backend services integrated with Azure Storage services, while maintaining accessibility standards and ensuring API design supported scalability for growing customer base."
      ],
      "environment": [
        "Python",
        "TypeScript",
        "React",
        "JavaScript",
        "Java",
        "Node.js",
        "HTML",
        "CSS",
        "Azure",
        "Azure Storage Services",
        "Azure Data Factory",
        "Azure DevOps",
        "Machine Learning techniques",
        "RESTful APIs",
        "Git",
        "CI/CD Pipelines",
        "Jest",
        "Agile Development Methodologies",
        "Authentication",
        "Authorization",
        "Security Best Practices",
        "Performance Optimization",
        "Responsive Design",
        "API Design Principles"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Wisconsin-Milwaukee",
      "degree": "Master's Degree",
      "field": "Information Technology, AI & Data Analytics",
      "year": "2024"
    }
  ],
  "certifications": [
    "Azure Data Engineer (DP-203)",
    "Azure AI Engineer (AI-101)",
    "Salesforce Developer-Associate"
  ]
}