{
  "name": "Aravind Reddy Datla",
  "title": "IT Service Management Professional",
  "contact": {
    "email": "aravind.datla05@gmail.com",
    "phone": "+1 9592488855",
    "portfolio": "",
    "linkedin": "https://www.linkedin.com/in/aravind-reddy-datla",
    "github": ""
  },
  "professional_summary": [
    "I am having 6 years of experience in IT Service Management, focusing on change management processes and ITIL frameworks that help organizations navigate digital transformations while minimizing business disruption and maintaining service quality.",
    "Utilized strong analytical skills to assess the impact of proposed IT changes on business operations, creating detailed risk assessments that helped stakeholders make informed decisions about implementation timelines and resource allocation.",
    "Developed comprehensive communication strategies for IT change initiatives, ensuring all affected parties received timely and relevant information about upcoming changes, which significantly reduced user resistance and improved adoption rates.",
    "Applied ITIL principles to streamline incident and problem management processes, resulting in faster resolution times and improved service quality metrics across multiple organizational departments and technology platforms.",
    "Collaborated with cross-functional teams to implement change management best practices, establishing standardized procedures that improved consistency in how IT changes were planned, approved, and deployed across the enterprise.",
    "Created detailed documentation for change management workflows, including process maps, role definitions, and escalation procedures that served as reference materials for new team members and stakeholders across the organization.",
    "Facilitated regular meetings with ITSM end users and vendors to gather feedback on change processes, identifying opportunities for improvement that led to more efficient change implementation cycles and increased user satisfaction.",
    "Analyzed change management metrics and KPIs to identify trends and patterns, presenting findings to leadership that informed strategic decisions about resource allocation and process improvements within the IT service delivery framework.",
    "Worked closely with technical teams to ensure proper testing and validation procedures were in place for all changes, developing checklists and quality assurance processes that minimized the risk of service disruptions during implementation.",
    "Assisted in the development and delivery of training programs on change management processes and ITIL methodologies, creating educational materials that helped team members understand their roles and responsibilities in the change lifecycle."
  ],
  "technical_skills": {
    "ITSM Frameworks": [
      "ITIL",
      "Change Management",
      "Incident Management",
      "Problem Management",
      "Knowledge Management"
    ],
    "Communication Tools": [
      "Microsoft Office Suite",
      "Jira",
      "Confluence",
      "ServiceNow",
      "Slack",
      "Microsoft Teams"
    ],
    "Analytical Tools": [
      "Data Analysis Using Python",
      "Excel",
      "Power BI",
      "Tableau",
      "SQL"
    ],
    "Project Management": [
      "Agile Methodologies",
      "Scrum",
      "Kanban",
      "Gantt Charts",
      "Risk Assessment"
    ],
    "Technical Documentation": [
      "Microsoft Visio",
      "Process Mapping",
      "Technical Writing",
      "SOP Creation",
      "Knowledge Base Management"
    ],
    "IT Infrastructure": [
      "Active Directory",
      "Cloud Services",
      "Network Management",
      "Security Protocols",
      "System Administration"
    ],
    "Change Management Tools": [
      "Change Advisory Board (CAB)",
      "Change Calendars",
      "Impact Assessment",
      "Risk Mitigation",
      "Rollback Procedures"
    ],
    "Service Management Platforms": [
      "BMC Helix ITSM",
      "Cherwell",
      "Zendesk",
      "Freshservice",
      "ManageEngine ServiceDesk"
    ],
    "Stakeholder Management": [
      "Vendor Relations",
      "User Training",
      "Executive Reporting",
      "Cross-functional Collaboration",
      "Negotiation"
    ],
    "Quality Assurance": [
      "Testing Protocols",
      "Validation Procedures",
      "Compliance Auditing",
      "Performance Metrics",
      "Continuous Improvement"
    ],
    "Data Analysis": [
      "Statistical Analysis",
      "KPI Tracking",
      "Trend Analysis",
      "Data Visualization",
      "Reporting"
    ],
    "Scripting & Automation": [
      "PowerShell",
      "Python",
      "Batch Scripting",
      "Workflow Automation",
      "Process Automation"
    ]
  },
  "experience": [
    {
      "role": "IT Change Management Analyst",
      "client": "UConn Dining Services",
      "duration": "2023-Aug - 2025-May",
      "location": "",
      "responsibilities": [
        "Managed the end-to-end change management process for the university dining services IT infrastructure, ensuring all modifications to systems followed ITIL best practices and minimized disruption to daily operations that serve thousands of students daily.",
        "Evaluated the impact of proposed IT changes on dining services operations, creating detailed risk assessments that helped stakeholders understand potential business disruptions and make informed decisions about implementation timelines and resource allocation.",
        "Developed and maintained the change calendar for all IT systems supporting dining services, coordinating with technical teams to schedule changes during low-impact periods and ensuring proper communication with all affected parties across multiple campus locations.",
        "Facilitated Change Advisory Board (CAB) meetings, presenting change proposals and impact assessments to stakeholders from dining services, IT, and university administration, which improved decision-making processes and alignment with business objectives.",
        "Created comprehensive documentation for change management workflows, including process maps, role definitions, and escalation procedures that served as reference materials for new team members and stakeholders across the university organization.",
        "Analyzed change management metrics and KPIs to identify trends and patterns, presenting findings to leadership that informed strategic decisions about resource allocation and process improvements within the IT service delivery framework for dining services.",
        "Collaborated with dining services management to understand business requirements and translate them into technical specifications for IT changes, ensuring that implemented solutions met operational needs and complied with university IT governance standards.",
        "Implemented a standardized process for emergency changes, establishing clear criteria for emergency classification and approval workflows that allowed for rapid response to critical issues while maintaining appropriate documentation and oversight.",
        "Trained dining services staff on new IT systems and processes resulting from implemented changes, developing user-friendly documentation and conducting hands-on training sessions that improved user adoption and reduced support tickets.",
        "Worked closely with the IT security team to ensure all changes complied with university security policies and industry best practices, conducting security assessments as part of the change approval process and documenting compliance measures.",
        "Coordinated with vendors and third-party service providers for changes involving external systems, managing relationships and ensuring that vendor activities aligned with university change management procedures and service level agreements.",
        "Continuously improved the change management process based on feedback and lessons learned, implementing modifications to procedures and documentation that increased efficiency and reduced the average time from change request to implementation."
      ],
      "environment": [
        "ITIL Framework",
        "Change Management",
        "Incident Management",
        "Problem Management",
        "Microsoft Office Suite",
        "Jira",
        "Confluence",
        "Active Directory",
        "Data Analysis Using Python",
        "Communication Skills",
        "Negotiation Skills",
        "Problem-Solving Skills"
      ]
    },
    {
      "role": "ITSM Process Specialist",
      "client": "Comcast (Accenture)",
      "duration": "2021-Jul - 2023-Jul",
      "location": "",
      "responsibilities": [
        "Designed and implemented ITIL-based change management processes for Comcast's telecommunications infrastructure, creating standardized procedures that improved consistency in how IT changes were planned, approved, and deployed across the enterprise.",
        "Analyzed the impact of proposed changes on telecommunications services, developing comprehensive risk assessments that identified potential service disruptions and created mitigation strategies to maintain service quality for millions of customers.",
        "Created detailed communication plans for IT changes affecting telecommunications services, ensuring all stakeholders received timely and relevant information about upcoming changes, which significantly reduced customer complaints and service interruptions.",
        "Collaborated with technical teams to establish proper testing and validation procedures for all changes, developing checklists and quality assurance processes that minimized the risk of service disruptions during implementation of critical network infrastructure.",
        "Facilitated regular meetings with ITSM end users and vendors to gather feedback on change processes, identifying opportunities for improvement that led to more efficient change implementation cycles and increased user satisfaction across the organization.",
        "Developed key performance indicators for change management processes, creating dashboards and reports that provided visibility into change success rates, implementation times, and business impact, which helped leadership make data-driven decisions.",
        "Worked with the incident and problem management teams to identify recurring issues related to changes, implementing proactive measures that reduced the number of change-related incidents by improving planning and testing procedures.",
        "Created and maintained the change management knowledge base, documenting best practices, lessons learned, and standard operating procedures that served as a reference for the entire IT organization and helped onboard new team members.",
        "Assisted in the development of training programs on change management processes and ITIL methodologies, creating educational materials that helped team members understand their roles and responsibilities in the change lifecycle.",
        "Coordinated with multiple departments to align change schedules with business activities, ensuring that critical changes were implemented during maintenance windows that minimized impact on telecommunications services and customer experience."
      ],
      "environment": [
        "ITIL Framework",
        "Change Management",
        "Incident Management",
        "Problem Management",
        "Knowledge Management",
        "Microsoft Office Suite",
        "Jira",
        "Confluence",
        "Telecommunications Systems",
        "Data Analysis Using Python",
        "Communication Skills",
        "Negotiation Skills"
      ]
    },
    {
      "role": "IT Service Support Analyst",
      "client": "Byjus",
      "duration": "2019-May - 2021-May",
      "location": "",
      "responsibilities": [
        "Supported the implementation of ITIL-based incident management processes for the educational technology platform, creating procedures that improved response times and resolution rates for technical issues affecting students and educators.",
        "Anzed incident data to identify recurring problems with the educational platform, working with development teams to implement permanent solutions that reduced ticket volumes and improved system reliability for millions of users.",
        "Created knowledge base articles for common technical issues, developing step-by-step guides that enabled users to resolve problems independently and reduced the workload on the IT support team during peak usage periods.",
        "Collaborated with the customer support team to understand user pain points with the educational platform, translating feedback into technical requirements that guided system improvements and enhanced user experience.",
        "Assisted in the development of a problem management process, establishing procedures for root cause analysis that helped prevent recurring incidents and improved overall system stability of the educational technology platform.",
        "Monitored system performance and user feedback to identify potential issues before they impacted service, implementing proactive monitoring procedures that reduced the number of critical incidents and improved service availability."
      ],
      "environment": [
        "ITIL Framework",
        "Incident Management",
        "Problem Management",
        "Knowledge Management",
        "Educational Technology Platforms",
        "Microsoft Office Suite",
        "Jira",
        "Data Analysis Using Python",
        "Microsoft Visio",
        "Communication Skills",
        "Problem-Solving Skills"
      ]
    }
  ],
  "education": [
    {
      "institution": "University of Connecticut, School of Business",
      "degree": "Master of Science",
      "field": "Business Analytics and Project Management in Business Data Science",
      "year": "2025"
    },
    {
      "institution": "Jawaharlal Nehru Technological University",
      "degree": "Bachelor of Technology",
      "field": "Information Technology in Computer Science",
      "year": "2021"
    }
  ],
  "certifications": [
    "IBM – Data Analysis Using Python",
    "Atlassian – Jira Fundamentals",
    "DataCamp – Intermediate Python"
  ]
}